<?php

class DaylyOnlineContract extends PdfBaseHelper
{

    public function __construct() {
        parent::__construct();
    }

    public function renderPdf($anketa, $zayavka) {
        $isBlanc = false;
        if( empty($zayavka->zayavkaNumb) ){
            $isBlanc = true;
        }
        mb_internal_encoding("UTF-8");
        $shortName = $anketa->surname . ' ' . mb_substr(trim($anketa->name), 0, 1) . '. ' . mb_substr(trim($anketa->lastname), 0, 1) . '.';
        $directorFullName = 'Максимова Максима Володимировича';
        $directorShortName = 'Максимов М.В.';
        $address = $anketa->contact_region . ' область';
        if ($anketa->contact_area) $address .= ', ' . $anketa->contact_area . ' район';
        $address .= ', г. ' . $anketa->contact_city;
        $address .= ', ул. ' . $anketa->contact_street;
        $address .= ' ' . $anketa->live_house;
        if ($anketa->live_corp) $address .= ', корпус ' . $anketa->live_corp;
        if ($anketa->live_flat) $address .= ', кв. ' . $anketa->live_flat;
        $fullName = $anketa->surname . ' ' . $anketa->name . ' ' . $anketa->lastname;
        $passport = $anketa->passport_seria . ' ' . $anketa->passport_number . ' вид. ' . $anketa->passport_issued . ' ' . date_create($anketa->passport_date)->format('d.m.Y') . 'р.';
        $dogDate = date_create()->format('d.m.Y');
        $math = new daylyCalcClass($zayavka);
        $finishDate = date_create();
        $interval = (int)$zayavka->srok + $math->_creditParams['_termmodifier'];
        $interval = new DateInterval ('P' . $interval . 'D');
        $finishDate = date_add($finishDate, $interval);
        $finishDate = $finishDate->format('d.m.Y');
        $contact_phone_mobile = $anketa->contact_phone_mobile;
        $iid = $anketa->iid;



        $pdf = $this->_pdf;
		$pdf->fontpath = Yii::app()->basePath.'/extensions/tfpdf/font/';
        $pdf->AddFont('DejaVu','','DejaVuSerifCondensed.ttf',true);
		
        $pdf->AddFont('DejaVu','B','DejaVuSerifCondensed-Bold.ttf',true);
        $pdf->AddFont('DejaVu','I','DejaVuSerifCondensed-Italic.ttf',true);
        $paragraphFontSize = 8;
        $pdf->AddPage();
        $pdf->SetFont('DejaVu','B',8);
        if($isBlanc){
            $pdf->Cell(0,10,'Проект Договору позики',0,2,C);
        } else {
            $pdf->Cell(0,10,'Договор позики № '.$zayavka->zayavkaNumb.' вiд '.$dogDate.'р.',0,2,C);
        }
        $this->WhiteLine();
        $this->Write('Товариство з обмеженою відповідальністю «Фінансова компанія «Кредитор-ХХІ» ','B');
        $this->Write('(далі - ');
        $this->Write('Позикодавець','B');
        $this->Write('), в особі ','');
        $this->Write($directorFullName,'U');
        $this->Write(' з однієї сторони, і фізична особа ','');
        $this->Write($fullName,'U');
        $this->Write(' (далі - Позичальник), який (яка) діє на підставі право - і дієздатності, з іншого боку,','');
        $this->LineBreak();
        $this->Write('які разом іменуються Сторони, уклали цей Договір позики (далі - Договір) про нижченаведене:','');
        $this->LineBreak();
        $this->WhiteLine();
        $this->Write('1. Терміни, які використовуються в Договорі.','B'); $this->LineBreak();
        $this->Write('1.1. Сайт  Позикодавця/Товариства ','B');
        $this->Write('- веб-сайт Позикодавець з адресою http://kredytor.com.ua, на якому Позичальник реєструє Персональний кабінет і має доступ до своєї особистої інформації, що має відношення до цього Договору. ','');
        $this->LineBreak();
        $this->Write('1.2. Заявка  ','B');
        $this->Write('-    заява /анкета Позичальника на отримання позики, подана/заповнена  у відповідності з умовами встановленими Позикодавцем. ','');
        $this->LineBreak();
        $this->Write('Заява/анкета  заповнюється Позичальником в разі якщо він користується послугами вперше, якщо Позичальник вже скористався послугами Позикодавця (','');
        $this->Write('не в он-лайн режимі','I');
        $this->Write('), Позичальник використовує свій Логін ','');
        $this->Write('(адреса електронної пошти Заявника), ','I');
        $this->Write(' і Пароль ','');
        $this->Write('(наданий Позикодавцем, який може бути змінений ним на власний розсуд)','I');
        $this->Write(',  і вже не заповнює анкету, а лише заявку на отримання кредиту.','');
        $this->LineBreak();
        $this->Write('1.3. Графік розрахунків ','B');
        $this->Write('- детальний розпис сукупної вартості Позики з урахуванням процентів за користування Позикою (Додаток 1). ','');
        $this->LineBreak();
        $this->Write('1.4. Аналог власноручного підпису ','B');
        $this->Write('– сукупність логіну і паролю персонального кабінету, за допомогою яких  Позичальник отримує доступ до свого персонального кабінету на сайті Позикодавця, а також, з допомогою якого підтверджує свою особу при здійсненні електронних операцій. ','');
        $this->LineBreak();
        $this->Write('1.5. Персональний  кабінет ','B');
        $this->Write('– сукупність захищених сторінок, що формуються Заявнику в момент його реєстрації на Сайті товариства (Персональний розділ Заявника), за допомогою якого Заявник/Позичальник здійснює повну взаємодію з Товариством, має постійний доступ до Графіку розрахунків та до іншої інформації/документів, пов\'язаної з наданням Товариством фінансових послуг. Доступ до Персонального кабінету здійснюється Заявником/Позичальником шляхом введення Логіна Персонального кабінету і Пароля Персонального кабінету на Сайті товариства, сукупність яких, за домовленістю Сторін договору позики та правовим статусом, прирівнюється до власноручного підпису.','');
        $this->LineBreak();
        $this->Write('1.6. Логін Персонального кабінету ','B');
        $this->Write('– унікальна комбінація букв та/або цифр ','');
        $this->Write('(адреса електронної пошти Заявника)','');
        $this->Write(', що встановлюється Заявником. Цю комбінацію Заявник самостійно зазначає в спеціальному полі «логін» при вході до Персонального кабінету. Заявник/Позичальник персонально несе відповідальність за збереженість Логіну Персонального Кабінету.','');
        $this->LineBreak();
        $this->Write('1.7. Пароль персонального кабінету ','B');
        $this->Write('- довільно вибрана Позичальником унікальна комбінація букв та/або цифр, що встановлюється Заявником. Цю комбінацію Заявник самостійно зазначає в спеціальному полі «пароль» при реєстрації нас сайті Позичальника. ','');
        $this->LineBreak();
        $this->Write('В разі якщо Позичальник вже скористався послугами Позикодавця (не в он-лайн режимі), Позичальник для входу в Персональний кабінет спочатку використовує Пароль, наданий Позикодавцем, який може бути змінений ним на власний розсуд в будь який момент.','');
        $this->Write('2. Предмет і строк договору. ','B');
        $this->LineBreak();
        $this->Write('2.1. ','B');
        $this->Write('Позикодавець  надає Позичальнику позику шляхом перерахування  Позичальнику на його банківський рахунок, грошових коштів (надалі – «Позика») в порядку та на умовах, передбачених даним Договором, а Позичальник приймає та зобов’язується повернути Позику з урахування процентів за її користування на розрахунковий рахунок Позикодавця, відповідно до умов та строків, визначених цим Договором.','');
        $this->LineBreak();
        $this->Write('2.2. ','B');
        $this->Write('Позика надається без застави, поруки та іншого забезпечення. Позика  надається Позичальнику на власні потреби та не є споживчим кредитом.','');
        $this->LineBreak();
        $this->Write('2.3. ','B');
        $this->Write('Сума Позики, строк користування позикою, розмір процентів та  сума за користування позикою зазначається в Додатку  до даного Договору.','');
        $this->LineBreak();
        $this->Write('2.4. ','B');
        $this->Write('Позика  надається Позичальнику після підписання даного Договору, шляхом перерахування грошових коштів з розрахункового рахунку Позикодавця на банківський (картковий) рахунок Позичальника.','');
        $this->LineBreak();
        $this->Write('Сторони прийшли згоди, що плата за користування Позикою нараховується з дати перерахування суми позики на банківський рахунок Позичальника, включно до дати повернення в касу або на розрахунковий рахунок  Позикодавця.','');
        $this->LineBreak();
        $this->Write('2.5. ','B');
        $this->Write('Нарахування процентів на суму Позики здійснюється відповідно до фактичної кількості календарних днів користування Позикою Позичальником, відповідно до п.2.1. цього Договору.','');
        $this->LineBreak();
        $this->Write('2.6. ','B');
        $this->Write('Датою погашення заборгованості за цим Договором вважається дата зарахування грошових коштів на поточний рахунок Позикодавця згідно умов цього Договору. ','');
        $this->LineBreak();
        $this->Write('2.7. ','B');
        $this->Write('Договір вважається укладеним з моменту його підписання, в порядку встановленому даним  Договором та  перерахування Позикодавцем Позики на рахунок Позичальника та діє до дати встановленої Додатком до даного Договору. В частині обов\'язку Позичальника повернути позику, сплати проценти за користування позикою, а також штрафні санкцій за невиконання або неналежне виконання Договору, так і у частині нарахування процентів Договір діє до належного виконання Позичальником своїх зобов\'язань. ','');
        $this->LineBreak();
        $this->WhiteLine();
        $this->Write('3. Порядок повернення Позики та сплати процентів за користування Позикою ','B');
        $this->LineBreak();
        $this->Write('3.1 ','B');
        $this->Write('Позичальник повертає позику  і сплачує проценти за користування Позикою шляхом перерахування грошових коштів на рахунок Позикодавця, зазначений в розділі 9 цього Договору в безготівковій формі, в спосіб, що зазначається на сайті Позикодавця або готівкою через касу відповідного ЦВК, адреси , яких також зазначаються на сайті Товариства.','');
        $this->LineBreak();
        $this->Write('3.2 ','B');
        $this->Write('Датою повернення Позики та датою сплати процентів за користування Позикою вважається дата надходження коштів на рахунок Позикодавця, зазначений в розділі 9 цього Договору в безготівковій формі або дата внесення готівкових коштів в касу відповідного ЦВК.','');
        $this->LineBreak();
        $this->Write('3.3 ','B');
        $this->Write('Позичальник має право здійснити дострокове повернення Позики як повністю, так і частково, зі сплатою процентів, нарахованих на суму фактично одержаної Позики та зазначених у Графіку розрахунків. ','');
        $this->LineBreak();
        $this->Write('3.4 ','B');
        $this->Write('У випадку часткового дострокового повернення Позики, у Графік розрахунків вносяться відповідні зміни. ','');
        $this->LineBreak();
        $this->Write('3.5 ','B');
        $this->Write('Позикодавець, у день надходження коштів в порядку пп. 3.4. цього Договору направляє ці кошти на погашення заборгованості в черговості, що встановлена  Договором. ','');
        $this->LineBreak();
        $this->Write('3.6 ','B');
        $this->Write('Заборгованість погашається в такій черговості: в першу чергу виплачуються проценти за користування Позикою; у другу чергу повертається сума Позики. ','');
        $this->LineBreak();
        $this->Write('В разі прострочення виконання зобов’язань щодо сплати  Позики Заборгованість погашається в такій черговості: в першу чергу виплачуються додаткові проценти  та  проценти за користування Позикою; в другу  чергу повертається сума Позики.','');
        $this->LineBreak();
        $this->Write('3.7 ','B');
        $this->Write('Позичальник зобов\'язаний сплатити Заборгованість будь-яким доступним йому способом, зазначеним на сайті Товариства.','');
        $this->LineBreak();
        $this->Write('При цьому в разі погашення заборгованості  не через  ЦВК, а будь-яким іншим способом ','');
        $this->Write('(платіжний термінал, сайт Товариства, тощо)','I');
        $this->Write(' Позикодавець самостійно встановлює порядок відшкодування послуг фінансового посередника ','');
        $this->Write('(в залежності від досягнутих домовленостей з відповідним фінансовим  посередником).','I');
        $this->LineBreak();
        $this->Write('3.8. Позичальник, має право за наявності згоди Позикодавця:','B');
        $this->LineBreak();
        $this->Write('3.8.1 ','B');
        $this->Write('подовжити строк дії Договору, за умови часткового погашення заборгованості щодо сплати процентів за користування Позикою за той строк, на який Позичальник має намір подовжити дію Договору; ','');
        $this->LineBreak();
        $this->Write('3.8.2 ','B');
        $this->Write('за умови повного погашення процентів за користування Позикою на день звернення – змінити строк користування Позикою в межах строку наданої Позики, а також повернути частину Позики.','');
        $this->LineBreak();
        $this->Write('При цьому в разі сплати Позичальником грошових  коштів в рахунок погашення заборгованості за процентами, що не покриватиме в повному обсязі розрахунковий день, такий залишок буде враховано в наступне погашення процентів за користування Позикою.','');
        $this->LineBreak();
        $this->Write('У вищевказаних  випадках до Графіку розрахунків вносяться відповідні зміни.','');
        $this->LineBreak();
        $this->Write('3.8.3 ','B');
        $this->Write('У разі, якщо Позичальник не повернув Позику та не сплатив проценти у встановлений Договором  строк, Позичальник сплачує Позикодавцю проценти за користування Позикою в період понад визначений Договором строк у розмірі,  встановленому другим абзацом п. 4. Графіку розрахунків. ','');
        $this->LineBreak();
        $this->Write('3.8.4 ','B');
        $this->Write('Сума процентів за користування Позикою, включаючи проценти  нараховується Позикодавцем в день погашення Позики  чи подовження Договору, при цьому враховується перший день надання Позики подовження дії Договору та день погашення Позики/сплати процентів за користування Позикою при подовженні Договору, але в будь-якому випадку мінімальним строком/розміром такого нарахування, є встановлений Позикодавцем розмір процентів за  перший календарний день. Таким чином, сума, обумовлена в Графіку розрахунків підлягає обов’язковому перерахунку з урахуванням фактичного строку користування Позикою у календарних днях на момент сплати. ','');
        $this->LineBreak();
        $this->Write('Розмір річної процентної ставки за користування Позикою, за умови вчасного виконання Позичальником своїх зобов’язань, визначається за формулою: Р% = Д%*КД (де Р% - це річна процентна ставка; Д% - денна процентна ставка, вказана в п. 8 Специфікації; КД – кількість днів в році).','');
        $this->LineBreak();
        $this->Write('3.9 ','B');
        $this->Write('Позикодавець має право в односторонньому порядку розірвати Договір і зажадати від Позичальника дострокового здійснення передбачених у Договорі платежів в наступних випадках: ','');
        $this->LineBreak();
        $this->Write('• Позичальник надав Позикодавцю  недостовірну інформацію для укладення цього Договору;','');
        $this->LineBreak();
        $this->Write('• Відкриття провадження судом по справах з майновими вимогами до Позичальника, враховуючи подання зустрічних позовів щодо Позичальника, а також відкриття виконавчого провадження з майновими вимогами до Позичальника, виявлення інших боргів Позичальника.','');
        $this->LineBreak();
        $this->Write('3.10 ','B');
        $this->Write('Сторони мають право укласти додаткову угоду, змінити Графік розрахунків. ','');
        $this->LineBreak();
        $this->WhiteLine();
        $this->Write('4. Порядок користування особистим кабінетом та підписання даного Договору.','B');
        $this->LineBreak();
        $this->Write('4.1 ','B');
        $this->Write('Для укладення Договору Позики позичальник реєструється (','');
        $this->Write('введення Логіну і Пароля','I');
        $this->Write('), авторизується  (','');
        $this->Write('підтвердження  Логіна і Пароля','');
        $this->Write(') та заповнює анкету на сайті Позичальника,  в разі якщо він користується послугам позичальника вперше.','');
        $this->LineBreak();
        $this->Write('Якщо Позичальник вже скористався послугами Позикодавця (','');
        $this->Write('не в он-лайн режимі','I');
        $this->Write('), Позичальник використовує свій Логін (','');
        $this->Write('адреса електронної пошти Заявника','I');
        $this->Write('),  і Пароль (','');
        $this->Write('наданий Позикодавцем, який може бути змінений ним на власний розсуд','I');
        $this->Write('),  і вже не заповнює анкету, а лише заявку на отримання кредиту.','');
        $this->LineBreak();
        $this->Write('4.2 ','B');
        $this->Write('Введення Логіна і Паролю  при вході в Персональний кабінет є підтвердженням особи Позичальника при створенні Заявок чи інших документів. ','');
        $this->LineBreak();
        $this->Write('4.3 ','B');
        $this->Write('Сторони встановили наступний порядок підписання Договору:','');
        $this->Write('Після отримання від Позикодавця підтвердження про надання позики, Позичальник переходить за посиланням  в свій особистий кабінет, в якому розміщено даний текст Договору,  після ознайомлення з ним Позичальник підвереджує свою згоду шляхом  поставлення відмітки  у вигляді «Прапорця» в категорії «Я приймаю умови договору», і активації категорії «Отримати кредит», після чого Позикодавець перераховує позику.    ','');
        $this->LineBreak();
        $this->WhiteLine();
        $this->Write('5. Використання аналога власноручного підпису та підписання Договору.','B');
        $this->LineBreak();
        $this->Write('5.1 ','B');
        $this->Write('Позичальник підтверджує, що сукупність Логіну і  Паролю, є  аналогом  його власноручного підпису і засвідчує його особу, Позичальник  визнає такий аналог власноручного підпису як еквівалент власного підпису. ','');
        $this->LineBreak();
        $this->Write('5.2 ','B');
        $this->Write('Позичальник також визнає всі документи, засвідчені з використанням аналога власноручного підпису, еквівалентними за значенням письмовим документам. Позичальник визнає, що використання аналога власноручного підпису в електронних повідомленнях, переданих у рамках використання Домашньої сторінки, породжує юридичні наслідки, аналогічні використанню власноручних підписів, відповідно до вимог законів, та всі документи, пов\'язані з використанням Домашньої сторінки та завірені аналогом власноручного підпису є еквівалентом документів у письмовій формі. ','');
        $this->LineBreak();
        $this->Write('5.3 ','B');
        $this->Write('Усі дії, вчинені в системі з використанням аналога власноручного підпису Позичальника, визнаються вчиненими особисто Позичальником. ','');
        $this->LineBreak();
        $this->Write('5.4 ','B');
        $this->Write('Заявки, створені в електронному вигляді на домашній сторінці та завірені аналогом власноручного підпису Позичальника та Заявки в паперовому вигляді, ідентичні за змістом та реквізитами, мають однакову юридичну силу. ','');
        $this->LineBreak();
        $this->Write('5.5 ','B');
        $this->Write('Позичальник зобов\'язується забезпечити збереження пароля і те, що пароль не стане відомий іншим особам. ','');
        $this->LineBreak();
        $this->WhiteLine();
        $this->Write('6. Попередження Позичальника по відношенню до дійсності умов Договору ','B');
        $this->LineBreak();
        $this->Write('6.1 ','B');
        $this->Write('При укладанні цього Договору Позичальник підтверджує, що: ','');
        $this->LineBreak();
        $this->Write('• він повністю дієздатний та відносно нього відсутні діючі рішення судів, які не скасовані, про обмеження його дієздатності чи визнання недієздатним, а також йому не відомо про подачу в суд заяв по зазначеним вимогам; ','');
        $this->LineBreak();
        $this->Write('• його волевиявлення є вільним і відповідає його внутрішній волі;','');
        $this->LineBreak();
        $this->Write('• він не знаходиться під дією важких для нього обставин, які змушують його укласти цей Договір; ','');
        $this->LineBreak();
        $this->Write('• він чітко усвідомлює всі умови цього Договору та не перебуває під впливом омани або обману; ','');
        $this->LineBreak();
        $this->Write('• він вважає умови цього Договору прийнятними для себе; ','');
        $this->LineBreak();
        $this->Write('• він діє за згодою своєї дружини (чоловіка). ','');
        $this->LineBreak();
        $this->WhiteLine();
        $this->Write('7. Відповідальність Сторін ','B');
        $this->LineBreak();
        $this->Write('7.1 ','B');
        $this->Write('Сторони несуть відповідальність за невиконання або неналежне виконання умов Договору у відповідності з чинним законодавством України і даним Договором. ','');
        $this->LineBreak();
        $this->WhiteLine();
        $this->Write('8. IНШI УМОВИ ДОГОВОРУ','B');
        $this->LineBreak();
        $this->Write('8.1 ','B');
        $this->Write('Цей Договір складено в 2 (двох) оригінальних примірниках українською мовою, по одному для кожної із Сторін, що мають однакову юридичну силу.','');
        $this->LineBreak();
        $this->Write('8.2 ','B');
        $this->Write('Невід\'ємною частиною цього Договору є «Регламент надання грошових коштів у позику фізичним особам» Товариства з обмеженою відповідальністю ','');
        $this->Write('«Фінансова компанія «КРЕДИТОР ХХІ»','I');
        $this->Write(' (далі  Регламент/Правила). Уклавши цей договір, Позичальник підтверджує, що він ознайомлений, повністю розуміє, погоджується і зобов\'язується неухильно дотримуватись Регламенту/Правил, текст яких розміщений на сайті Позикодавця: http://kredytor.com.ua','');
        $this->LineBreak();
        $this->Write('8.3 ','B');
        $this->Write('Усі не врегульовані цим Договором правовідносини Сторін регулюються чинним законодавством України.','');
        $this->LineBreak();
        $this->WhiteLine();
        $this->Write('8.4 Позичальник підтверджує, що:','B');
        $this->LineBreak();
        $this->Write('- отримав від Позикодавця до укладення цього Договору інформацію, зазначену в частині другій статті 12 Закону України «Про фінансові послуги та державне регулювання ринків фінансових послуг», та в частині другій статті 11 Закону України «Про захист прав споживачів»;','');
        $this->LineBreak();
        $this->Write('- повідомлений про свої права згідно частини шостої статті 11 Закону України «Про захист прав споживачів» та статті 8 Закону України «Про захист персональних даних»,','');
        $this->LineBreak();
        $this->Write('- інформація надана Позикодавцем з дотриманням вимог законодавства про захист прав споживачів та забезпечує правильне розуміння Позичальником суті фінансової послуги без нав\'язування її придбання;','');
        $this->LineBreak();
        $this->Write('- до укладення цього Договору надав згоду, усвідомлюючи її правові наслідки, на використання в якості аналога власноручного підпису для цього Договору Пароля Особистого Кабінету;','');
        $this->LineBreak();
        $this->Write('- надав згоду на передачу Позикодавцю своїх персональних даних та їх обробку з метою оцінки фінансового стану Позичальника та його спроможності виконати зобов\'язання за договором позики;','');
        $this->LineBreak();
        $this->Write('- надав згоду на те, що Позикодавець має право звертатись за інформацією про фінансовий стан Позичальника до третіх осіб, які пов‘язані з Позичальником діловими, професійними, особистими, сімейними або іншими стосунками.','');
        $this->LineBreak();
        $this->Write('- надав згоду на те, що у разі невиконання або неналежного виконання зобов\'язань Позичальника перед Позикодавцем на підставі цього Договору, Позикодавець має право передати персональні дані Позичальника третім особам (включаючи, але не обмежуючись, Бюро кредитних історій, кредитним установам, колекторським компаніям) для захисту своїх законних прав та інтересів, стягнення Заборгованості за договором позики, договірної неустойки, збитків та інших засобів правового захисту.','');
        $this->LineBreak();
        $this->Write('- надав згоду на - отримання від Позикодавця інформації за всіма вказаними ним  засобами зв’язку (мобільний телефон, електронна адреса, тощо)','');
        $this->LineBreak();
        $this->Write('8.5 ','B');
        $this->Write('Недійсність окремих умов цього Договору, встановлена рішенням суду, не має наслідком недійсності всього Договору, та в будь-якому разі не звільняє Позичальника від грошового зобов\'язання повернути позику та сплатити проценти за користування позикою.','');
        $this->LineBreak();
        $this->WhiteLine();
        $this->Write('9.РЕКВІЗИТИ ТА ПІДПИСИ СТОРІН.','B');
        $this->LineBreak();
        $this->WhiteLine();
        $pdf->SetFont('DejaVu','B',$paragraphFontSize);
        $pdf->Cell(90,4,"Кредитор:",0,0,C);
        $pdf->Cell(90,4,"Позичальник:",0,0,C);
        $this->LineBreak();
        $currentY = $pdf->GetY();
        //$pdf->Rect(20, $currentY, 170, 50);
        //$pdf->Line(103, $currentY, 103, 105);
        $texts = array(
            'ТОВ «ФК «КРЕДИТОР XXІ»',
            ' ',
            'Директор',
            ' ',
            '_____________  '.$directorShortName,
        );
        $pdf->SetFont('DejaVu','B',$paragraphFontSize);
        $this->CellCol(25, 4, $texts[0], 60, $currentY+4);
        $this->CellCol(25, 4, $texts[1], 60);
        $this->CellCol(25, 4, $texts[2], 60);
        $this->CellCol(25, 4, $texts[3], 60);
        $leftColY = $this->CellCol(25, 4, $texts[4], 60);
        $texts = array(
            $fullName,
            'Місце проживання: '.$address,
            'Тел.: '.$contact_phone_mobile,
            'ІПН: '.$iid,
            'Паспорт: '.$passport,
            ' ',
            '_____________  '.$shortName,
        );
        $pdf->SetFont('DejaVu','B',$paragraphFontSize);
        $this->CellCol(115, 4, $texts[0], 60, $currentY+4);
        $pdf->SetFont('DejaVu','',$paragraphFontSize);
        $this->CellCol(115, 4, $texts[1], 60);
        $this->CellCol(115, 4, $texts[2], 60);
        $this->CellCol(115, 4, $texts[3], 60);
        $this->CellCol(115, 4, $texts[4], 60);
        $this->CellCol(115, 4, $texts[5], 60);
        $pdf->SetFont('DejaVu','B',$paragraphFontSize);
        $this->CellCol(115, 4, $texts[6], 60);

        /*****************************Додаток*****************************************/
        $pdf->AddPage();
		
		$this->printIDCS($zayavka);
		
		$this->LineBreak();
        $this->WhiteLine();
        if($isBlanc){
            $this->Write('Додаток № 1 до Договору позики № '.'#проект договору#'.' вiд '.$dogDate.'.','B');
        } else {
            $this->Write('Додаток № 1 до Договору позики № '.$zayavka->zayavkaNumb.' вiд '.$dogDate.'р.','B');
        }
        $this->LineBreak();
        $this->WhiteLine();
        $this->Write('1. Строк, на який надається Позика: ','B');
        $this->Write($anketa->srok. "дн.",'U');
        $this->LineBreak();
        $this->WhiteLine();
        $this->Write('2. Дата повернення Позики: ','B');
        $this->Write($finishDate.'.','U');
        $this->LineBreak();
        $this->WhiteLine();
        $this->Write('3. Сума Позики, перерахована Позичальнику становить ','B');
        $this->Write($zayavka->summ.' грн.','U');
        $this->LineBreak();
        $this->WhiteLine();
        $this->Write('4. ','B');
        $this->Write('При поверненні Позики Позичальник сплачує проценти за користування Кредитом iз розрахунку ','');
        $this->Write($math->_creditParams['_percentstage'].'%','U');
        $this->Write(' в день вiд суми Кредиту, ','');
        $this->LineBreak();
        $this->Write('в тому числі не менше, ','');
        $this->Write(number_format(floatval($math->_creditParams['_firstdayminpay']),2).' ','U');
        $this->Write('гривень за перший день користування кредитом, що складає ','');
        $this->Write(number_format(floatval($zayavka->summPercent),2).' грн.','U');
        $this->LineBreak();
        $this->Write('У разi невиконання своїх зобов\'язань у строк,','');
        $this->LineBreak();
        $this->Write('Позичальник сплачує додатково ','');
        $this->Write($math->_creditParams['_penystage'].'% ','U');
        $this->Write('вiд суми Кредиту за кожний день  прострочення, починаючи з ','');
        $this->Write($math->_creditParams['_panydaystart']+1,'U');
        $this->Write('-го  дня прострочення.','');
        $this->LineBreak();
        $this->WhiteLine();
        $this->Write('5. ','B');
        $this->Write('Сума до повернення без урахування фактичного строку користування Кредитом та  перерахунку згiдно п. 4 Додатку: ','');
        $this->Write(number_format(floatval($zayavka->summ+$zayavka->summPercent),2).' грн.','U');
        $this->LineBreak();
        $this->WhiteLine();
        $this->Write('6. ','B');
        $this->Write('Даний  Додаток  є невід’ємною частиною Договору. ','');
        $this->LineBreak();
        $this->WhiteLine();
        $this->WhiteLine();
        $currentY = $pdf->GetY();
        $this->CellCol(25, 4, 'Від Кредитодавця: __________________', 60, $currentY+4);
        $this->CellCol(25, 4, '/'.$directorShortName.'/', 60);
        $this->CellCol(115, 4, 'Від Позичальника: __________________', 60, $currentY+4);
        $this->CellCol(115, 4, '/'.$shortName.'/', 60);
        if($isBlanc){
            $dogNum = $iid;
        } else {
            $dogNum = $zayavka->zayavkaNumb;
        }
        $pdf->Output(Yii::app()->basePath.'/data/contracts/' . $dogNum . '.pdf', 'F');
        return $dogNum;

    }
}